---
kind: method
id: M:Autodesk.Revit.DB.Macros.DocumentEntryPoint.FinishInitializationEO
source: html/7c75cb69-106c-f322-374e-7e2f0733a53c.htm
---
# Autodesk.Revit.DB.Macros.DocumentEntryPoint.FinishInitializationEO Method

For Revit Macros internal use only.

## Syntax (C#)
```csharp
public void FinishInitializationEO()
```